#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/intel-hashicorp/intel-azure-example-app/runs/run-89gmVBFXE9gQYZEv

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
module.optimized-mysql-server.data.azurerm_resource_group.rg: Reading...
module.optimized-mysql-server.data.azurerm_resource_group.rg: Read complete after 0s [id=/subscriptions/d4ab7583-eee6-45fe-9487-a7a0b59a389a/resourceGroups/terraform-example-app-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.optimized-mysql-server.azurerm_mysql_flexible_server.mysql will be created
  + resource "azurerm_mysql_flexible_server" "mysql" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "dev-intel-example-app01"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "terraform-example-app-rg"
      + sku_name                      = "MO_Standard_E8ds_v5"
      + tags                          = {
          + "Duration" = "8"
          + "Owner"    = "Intel.Terraform.Example.App@intel.com"
        }
      + version                       = "8.0.21"
      + zone                          = "1"

      + high_availability {
          + mode                      = "ZoneRedundant"
          + standby_availability_zone = "2"
        }

      + storage {
          + auto_grow_enabled = true
          + iops              = 10000
          + size_gb           = 2048
        }

      + timeouts {}
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["character_set_server"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "character_set_server"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "latin1"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["collation_server"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "collation_server"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "latin1_swedish_ci"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_adaptive_flushing"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_adaptive_flushing"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "ON"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_adaptive_hash_index"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_adaptive_hash_index"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "OFF"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_change_buffering"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_change_buffering"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "none"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_file_per_table"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_file_per_table"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "ON"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_flush_neighbors"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_flush_neighbors"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "0"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_io_capacity"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_io_capacity"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "4000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_io_capacity_max"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_io_capacity_max"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "20000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_log_buffer_size"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_log_buffer_size"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "67108864"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_log_file_size"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_log_file_size"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "1073741824"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_lru_scan_depth"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_lru_scan_depth"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "9000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_max_dirty_pages_pct"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_max_dirty_pages_pct"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "90"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_max_dirty_pages_pct_lwm"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_max_dirty_pages_pct_lwm"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "10"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_max_purge_lag"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_max_purge_lag"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "0"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_max_purge_lag_delay"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_max_purge_lag_delay"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "300000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_open_files"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_open_files"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "4000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_page_cleaners"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_page_cleaners"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "4"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_purge_threads"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_purge_threads"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "4"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_read_io_threads"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_read_io_threads"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "16"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_spin_wait_delay"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_spin_wait_delay"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "6"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_stats_persistent"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_stats_persistent"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "ON"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_thread_concurrency"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_thread_concurrency"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "0"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["innodb_write_io_threads"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "innodb_write_io_threads"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "16"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["join_buffer_size"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "join_buffer_size"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "32768"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["max_connections"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "max_connections"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "10900"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["max_prepared_stmt_count"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "max_prepared_stmt_count"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "128000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["performance_schema"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "performance_schema"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "OFF"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["sort_buffer_size"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "sort_buffer_size"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "32768"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["table_open_cache"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "table_open_cache"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "8000"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["table_open_cache_instances"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "table_open_cache_instances"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "16"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_configuration.mysql["transaction_isolation"] will be created
  + resource "azurerm_mysql_flexible_server_configuration" "mysql" {
      + id                  = (known after apply)
      + name                = "transaction_isolation"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + value               = "REPEATABLE-READ"
    }

  # module.optimized-mysql-server.azurerm_mysql_flexible_server_firewall_rule.firewall["Services"] will be created
  + resource "azurerm_mysql_flexible_server_firewall_rule" "firewall" {
      + end_ip_address      = "192.168.10.50"
      + id                  = (known after apply)
      + name                = "Services"
      + resource_group_name = "terraform-example-app-rg"
      + server_name         = "dev-intel-example-app01"
      + start_ip_address    = "192.168.10.0"
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_allocated_storage         = 2048
  + db_auto_grow_enabled         = true
  + db_backup_retention          = 7
  + db_charset                   = ""
  + db_collation                 = ""
  + db_create_mode               = "Default"
  + db_engine_version_actual     = "8.0.21"
  + db_firewall_rules            = {
      + Services = {
          + end_ip_address      = "192.168.10.50"
          + id                  = (known after apply)
          + name                = "Services"
          + resource_group_name = "terraform-example-app-rg"
          + server_name         = "dev-intel-example-app01"
          + start_ip_address    = "192.168.10.0"
          + timeouts            = null
        }
    }
  + db_ha_mode                   = "ZoneRedundant"
  + db_ha_standby_zone           = "2"
  + db_hostname                  = (known after apply)
  + db_id                        = (known after apply)
  + db_iops                      = 10000
  + db_location                  = "eastus"
  + db_maintenance_window_day    = ""
  + db_maintenance_window_hour   = ""
  + db_maintenance_window_minute = ""
  + db_name                      = ""
  + db_password                  = (sensitive value)
  + db_replica_role              = (known after apply)
  + db_resource_group_name       = "terraform-example-app-rg"
  + db_server_name               = "dev-intel-example-app01"
  + db_server_sku                = "MO_Standard_E8ds_v5"
  + db_username                  = (sensitive value)
  + db_zone                      = "1"

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 34 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @lucasmelogithub, Action: `pull_request`*